[
  {
    "jobTitle": "Prog Mgr, Clin Onboard & Dev",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133370/prog-mgr%2c-clin-onboard-%26-dev/job?in_iframe=1",
    "Description": [
      "As part of this work, we are enhancing the new hire orientation experience and development opportunities for our teams, setting them up for success early on. If professional challenges excite you, and you value the opportunity to create and build new solutions for nursing clinicians, this role presents an unparalleled opportunity for impact of your work and expertise. The Program Manager Clinical/Patient Facing role is part of the Emory Healthcares System Talent team and directly enables our commitment to be the best place to grow by building and deploying an effective New Employee Orientation and leadership development programs that optimize the learners experience and business impact. The role reports to the Sr. Manager, Learning & Development and will be responsible for the Emory Healthcare system-wide Patient Services Orientation (PSO) and the design of specific leadership development content for clinical leaders in alignment with the Emory Healthcare core leadership development programs. The role will leverage strong facilitation skills to connect with our program participants and support their learning experience and insights. Close partnership with our nursing and clinical leadership teams to inform orientation and clinical leaders development needs is key for success in the role. As a core member of the Learning and Development team the Program Manager, Clinical Orientation and Development will also support the delivery of dedicated content for clinical leaders as part of our core programs as needed. Focus Areas for Highest Impact: Program Management 1. Lead the development of a redesign of the methods, timing and implementation plans to ensure agreed outcomes in PSO orientation, professional skills and leadership development for clinical/patient facing leaders are achieved. 2. Own the Clinical/Patient Facing leaders development track including the creation and continuous improvement of content design and ongoing delivery across Emory Healthcare. Work closely with Clinical and nursing SMEÂ¿s to design relevant, current and prepare faculty for each program section. 3. Own reporting for clinical orientation to measure progress and impact of the sessions with desired outcomes and ensure that continuous improvements are made. 4. Monitor, review and conduct program evaluations to measure effectiveness, training impact, ROI/costs, and compile training progress reports. 5. Own communications strategy to drive awareness of clinical/patient facing development programs including partnering with EHC communications team and internal instructional design experts on marketing materials such as brochures, catalogs, emails, system communications etc. 6. Own program logistics by establishing program agendas, room bookings, organizing catering, scheduling speakers and coordinating training invite etc. 7. Maintain professional growth by participating in educational programs and professional organizations and activities to maintain a knowledge of national trends and to promote leading edge performance and expertise within the department. 8. Work with HR, nursing, clinical leaders and key stakeholders to ensure deliver relevant, meaningful and practical learning solutions at sale. Advanced Facilitation 1. Facilitate high quality programs using various forms and formats including group discussion, lecture, simulations, videos and platforms to support virtual and in-person learning (occasional travel may be required). 2. Partner with clinical SMEs and faculty experts to prepare them for their orientation sections, ensure engaging and impactful content for our participants 3. Maintain regular cadence of incorporating orientation program feedback and changes in the business to update content timely Program Design 1. Design clinical orientation and onboarding programs to address point of care needs relating to clinical competency, professional development, functional development, team building, and leadership development for clinical staff. 2. Curate content into multi-modal experiences for maximum training and development impact. 3. Research new training materials and best practices to address orientation needs and to improve engagement with participating employees 4. Perform other related work as assigned Skills and Experience Requirements 1. Masters Degree in Education, Industrial Psychology, Nursing or related field preferred; 2. Clinical / patient-facing experience in an inpatient or clinical environment 3. Ability to design and deliver highly engaging and impactful learning content 4. Strong understanding of challenges in hospital environments and patient facing roles 5. Specialist-level depth in learning and development 6. Strong facilitation, interpersonal and communication skills with the ability to relate to a variety of audiences 7. Strong experience partnering and stakeholder engagement 8. Effective project management skills; organized and detail-oriented 9. Ability to apply functional expertise to design and deploy learning solutions 10. Strong communication skills; ability to effectively present learning analytics and qualitative insights concisely to leadership 11. Innovative thinking and proven ability to research innovative learning and development practices and tools to continuously enrich and enhance Emory Healthcare learning and development practice 12. Tolerance for ambiguity and the ability to adapt to changing business needs 13. Customer centricity focus and ability to build strong working relationships with internal and external partners 14. Strong problem-solving capabilities 15. This is a Hybrid role. Ability to travel to Emory Healthcare locations in the Atlanta area and deliver in-person orientation each week is required",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "2414a016-965e-4132-a8b6-8f2c77380048"
  },
  {
    "jobTitle": "Senior Net Patient Service Revenue Analyst",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133282/senior-net-patient-service-revenue-analyst/job?in_iframe=1",
    "Description": [
      "PHYSICAL REQUIREMENTS (MediumMax 25lbs): up to 25 lbs, 0-33% of the work day (occasionally); 11-25 lbs, 34-66% of the workday (frequently); 01-10 lbs, 67-100% of the workday (constantly); Lifting 25 lbs max; Carrying of objects up to 25 lbs; Occasional to frequent standing & walking, Occasional sitting, Close eye work (computers, typing, reading, writing), Physical demands may vary depending on assigned work area and work tasks. ENVIRONMENTAL FACTORS: Factors affecting environment conditions may vary depending on the assigned work area and tasks. Environmental exposures include, but are not limited to: Blood-borne pathogen exposure Bio-hazardous waste Chemicals/gases/fumes/vapors Communicable diseases Electrical shock , Floor Surfaces, Hot/Cold Temperatures, Indoor/Outdoor conditions, Latex, Lighting, Patient care/handling injuries, Radiation , Shift work, Travel may be required. Use of personal protective equipment, including respirators, environmental conditions may vary depending on assigned work area and work tasks.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "9bc147c4-7b40-424a-ab2f-2d914a925a97"
  },
  {
    "jobTitle": "Clinical Research Coordinator I (ETS) | Temporary",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133239/clinical-research-coordinator-i-%28ets%29-%7c-temporary/job?in_iframe=1",
    "Description": [
      "Emory University is a leading research university that fosters excellence and attracts world-class talent to innovate today and prepare leaders for the future. We welcome candidates who can contribute to the diversity and excellence of our academic community.",
      "The Clinical Research Coordinator handles or assists with the administrative activities generally associated with the conduct of clinical trials.",
      "",
      "KEY RESPONSIBILITIES:",
      "MINIMUM QUALIFICATIONS:",
      "This position is intended to support clinical research and all clinical training requirements must be tracked and monitored through Emory Healthcare under the credentialing category of Clinical Researcher.",
      "Emory University is dedicated to providing equal opportunities and equal access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression, and veteran's status. Emory University does not discriminate in admissions, educational programs, or employment on the basis of any factor stated above or prohibited under applicable law. Students, faculty, and staff are assured of participation in University programs and in the use of facilities without such discrimination. Emory University complies with Executive Order 11246, as amended, Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veteran's Readjustment Assistance Act, and applicable executive orders, federal and state regulations regarding nondiscrimination, equal opportunity and affirmative action. Emory University is committed to achieving a diverse workforce through application of its affirmative action, equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training. Inquiries regarding this policy should be directed to the Emory University Department of Equity and Inclusion, 201 Dowman Drive, Administration Building, Atlanta, GA 30322.",
      "Emory University is committed to providing reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request a reasonable accommodation, please contact the Department of Accessibility Services at 404-727-9877 (V) | 404-712-2049 (TDD). Please note that one week advance notice is preferred.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "f6eb77ff-535f-43ae-8155-c7347ef1e740"
  },
  {
    "jobTitle": "PCC - Complex Scheduler",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133171/pcc---complex-scheduler/job?in_iframe=1",
    "Description": [
      "Be inspired. Be valued. Belong.",
      "",
      "At Emory Healthcare we fuel your professional journey with better benefits, valuable resources, ongoing mentorship and leadership programs for all types of jobs, and a supportive environment that enables you to reach new heights in your career and be what you want to be.  We provide:",
      "Ongoing mentorship, development, leadership programs...and more!",
      "This position is PRN.",
      "",
      "We're seeking a PCC - Complex Scheduler who will work collaboratively with staff and patients to schedule complex appointments.  This individual will:",
      "",
      "MINIMUM REQUIREMENTS:",
      "Supporting a diverse, equitable and inclusive culture.  Emory Healthcare (EHC) is dedicated to providing equal opportunities and access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression and/or veteran's status. EHC does not discriminate on the basis of any factor stated above or prohibited under applicable law. EHC respects, values, and celebrates the unique perspectives and backgrounds of all individuals. EHC aspires to create an environment of collaboration and true belonging for all our patients and team members.  Emory Healthcare (EHC) is committed to achieving a diverse workforce through equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training.",
      "",
      "ACCOMODATIONS: EHC will provide reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request a reasonable accommodation, please contact the Office of Diversity, Equity, and Inclusion.”",
      "",
      "PHYSICAL REQUIREMENTS: (Medium-Heavy) 36-75 lbs., 0-33% of the work day (occasionally); 20-35 lbs., 34-66% of the workday; (frequently); 10-20 lbs., 67-100% of the workday (constantly); Lifting 75 lbs. max; Carrying of objects up to 35 lbs.; Occasional to frequent standing & walking; Occasional sitting; Close eye work (computers, typing, reading, writing); Physical demands may vary depending on assigned work area and work tasks.ENVIRONMENTAL FACTORS: Factors affecting environment conditions may vary depending on the assigned work area and tasks. Environmental exposures include, but are not limited to: Blood-borne pathogen exposure; Bio-hazardous waste Chemicals/gases/fumes/vapors; Communicable diseases; Electrical shock; Floor Surfaces; Hot/Cold Temperatures; Indoor/Outdoor conditions; Latex; Lighting; Patient care/handling injuries; Radiation; Shift work; Travel may be required; Use of personal protective equipment, including respirators; environmental conditions may vary depending on assigned work area and work tasks.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "6edb8a40-f0f9-4d46-a3e7-c4314cd29973"
  },
  {
    "jobTitle": "Admission Communication Manager (ETS - Assigned to School of Law)",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133158/admission-communication-manager-%28ets---assigned-to-school-of-law%29/job?in_iframe=1",
    "Description": [
      "The temporary Communication Manager assists Emory Law during the leave of an employee and is responsible for developing and executing integrated marketing and communications plans that recruit and on-board students for all degree programs. Our degree programs include Juris Doctor (JD), Master of Legal Studies (JM), Master of Laws (LLM), Master of Comparative Law (MCL), Doctor of Juridical Science (SJD), and joint programs with other Emory University schools.  The position reports to the Assistant Dean of Admissions and works in partnership with the communications team.",
      "",
      "The Communication Manager Duties may include:",
      "Job Description:",
      "Minimum Qualifications:",
      "Preferred Qualifications:",
      "",
      "To Apply:",
      "",
      "More About Emory Law:",
      "Emory Law is a national and global leader in legal education that welcomes and supports a diverse law school community, produces path-breaking and influential scholarship, and offers exceptional teaching and practical learning opportunities that enable our alumni to become respected professionals and leaders in a rapidly changing world. Together, our community is working to secure a more fair and just society by advancing the rule of law.  Our innovative strategic plan seeks to fuel the ambitions and success of the students, staff and faculty who are drawn to join the Emory Law community.  We need people like you to join us so that our vision becomes reality.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "d31bdccf-068d-4560-bd2c-04614ea427ba"
  },
  {
    "jobTitle": "Senior Accountant Hospital Finance",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133146/senior-accountant-hospital-finance/job?in_iframe=1",
    "Description": "NA",
    "jobID": "362e4cfb-b2a0-4dd1-9b34-5b2e8988af7a"
  },
  {
    "jobTitle": "Revenue Cycle Specialist",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133141/revenue-cycle-specialist/job?in_iframe=1",
    "Description": [
      "Be inspired.  Be rewarded. Belong. At Emory Healthcare.",
      "At Emory Healthcare we fuel your professional journey with better benefits, valuable resources, ongoing mentorship and leadership programs for all types of jobs, and a supportive environment that enables you to reach new heights in your career and be what you want to be.  We provide:",
      "Revenue Cycle Specialist I",
      "",
      "JOIN OUR TEAM TODAY! Emory Healthcare (EHC), part of Emory University (EUV), is the most comprehensive academic health system in Georgia and the first and only in Georgia with a Magnet® designated ambulatory practice. We are made up of 11 hospitals-4 Magnet® designated, the Emory Clinic, and more than 425 provider locations. The Emory Healthcare Network, established in 2011, is the largest clinically integrated network in Georgia, with more than 3,450 physicians concentrating in 70 different subspecialties.",
      "",
      "Supporting a diverse, equitable and inclusive culture.  Emory Healthcare (EHC) is dedicated to providing equal opportunities and access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression and/or veteran's status. EHC does not discriminate on the basis of any factor stated above or prohibited under applicable law. EHC respects, values, and celebrates the unique perspectives and backgrounds of all individuals. EHC aspires to create an environment of collaboration and true belonging for all our patients and team members.  Emory Healthcare (EHC) is committed to achieving a diverse workforce through equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training.",
      "",
      "ACCOMODATIONS: EHC will provide reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request a reasonable accommodation, please contact the Office of Diversity, Equity, and Inclusion.”",
      "",
      "PHYSICAL REQUIREMENTS (MediumMax 25lbs):",
      "up to 25 lbs, 0-33% of the work day (occasionally); 11-25 lbs, 34-66% of the workday (frequently); 01-10 lbs, 67-100% of the workday (constantly); Lifting 25 lbs max; Carrying of objects up to 25 lbs; Occasional to frequent standing & walking, Occasional sitting, Close eye work (computers, typing, reading, writing), Physical demands may vary depending on assigned work area and work tasks. ENVIRONMENTAL FACTORS:",
      "Factors affecting environment conditions may vary depending on the assigned work area and tasks. Environmental exposures include, but are not limited to: Blood-borne pathogen exposure Bio-hazardous waste Chemicals/gases/fumes/vapors Communicable diseases Electrical shock , Floor Surfaces, Hot/Cold Temperatures, Indoor/Outdoor conditions, Latex, Lighting, Patient care/handling injuries, Radiation , Shift work, Travel may be required. Use of personal protective equipment, including respirators, environmental conditions may vary depending on assigned work area and work tasks.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "a035737d-99a7-4a8a-baa7-7dc8cff5753b"
  },
  {
    "jobTitle": "Public Safety Dispatcher",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133139/public-safety-dispatcher/job?in_iframe=1",
    "Description": [
      "Be inspired. Be valued. Belong.",
      "",
      "At Emory Healthcare we fuel your professional journey with better benefits, valuable resources, ongoing mentorship and leadership programs for all types of jobs, and a supportive environment that enables you to reach new heights in your career and be what you want to be.  We provide:",
      "Ongoing mentorship, development, leadership programs...and more!",
      "This position is PRN.",
      "",
      "We are seeking an Public Safety Dispatcher to help keep our community safe. We support Emory Healthcare's mantra of \"We're all in this together.\" Our goal is to offer Security Services worthy of premier healthcare. As such, we are committed to providing a safe environment for our patients, their families and guests, and our staff and neighbors.  We offer value-enriched services such as friendly-approachable officers, valuables storing, access control, Identification badges and parking. Each service has been personally developed for the purpose of exceeding your service expectations.  This individual will:",
      "MINIMUM REQUIREMENTS:",
      "",
      "Supporting a diverse, equitable and inclusive culture.  Emory Healthcare (EHC) is dedicated to providing equal opportunities and access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression and/or veteran's status. EHC does not discriminate on the basis of any factor stated above or prohibited under applicable law. EHC respects, values, and celebrates the unique perspectives and backgrounds of all individuals. EHC aspires to create an environment of collaboration and true belonging for all our patients and team members.  Emory Healthcare (EHC) is committed to achieving a diverse workforce through equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training.",
      "",
      "ACCOMODATIONS: EHC will provide reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request a reasonable accommodation, please contact the Office of Diversity, Equity, and Inclusion.”",
      "",
      "PHYSICAL REQUIREMENTS: (Medium-Heavy) 36-75 lbs., 0-33% of the work day (occasionally); 20-35 lbs., 34-66% of the workday; (frequently); 10-20 lbs., 67-100% of the workday (constantly); Lifting 75 lbs. max; Carrying of objects up to 35 lbs.; Occasional to frequent standing & walking; Occasional sitting; Close eye work (computers, typing, reading, writing); Physical demands may vary depending on assigned work area and work tasks.ENVIRONMENTAL FACTORS: Factors affecting environment conditions may vary depending on the assigned work area and tasks. Environmental exposures include, but are not limited to: Blood-borne pathogen exposure; Bio-hazardous waste Chemicals/gases/fumes/vapors; Communicable diseases; Electrical shock; Floor Surfaces; Hot/Cold Temperatures; Indoor/Outdoor conditions; Latex; Lighting; Patient care/handling injuries; Radiation; Shift work; Travel may be required; Use of personal protective equipment, including respirators; environmental conditions may vary depending on assigned work area and work tasks.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "6c5a352d-03d9-41c4-bed4-4210aeb9ee34"
  },
  {
    "jobTitle": "Senior Hospital Accountant",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133125/senior-hospital-accountant/job?in_iframe=1",
    "Description": [
      "Minimum Qualifications:",
      "Supporting a diverse, equitable and inclusive culture.  Emory Healthcare (EHC) is dedicated to providing equal opportunities and access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression and/or veteran's status. EHC does not discriminate on the basis of any factor stated above or prohibited under applicable law. EHC respects, values, and celebrates the unique perspectives and backgrounds of all individuals. EHC aspires to create an environment of collaboration and true belonging for all our patients and team members.  Emory Healthcare (EHC) is committed to achieving a diverse workforce through equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "8bd54530-92da-43a6-bfd7-bbbe1bac424f"
  },
  {
    "jobTitle": "Perioperative Services Materials Coordinator",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133099/perioperative-services-materials-coordinator/job?in_iframe=1",
    "Description": [
      "",
      "Be inspired.  Be rewarded. Belong. At Emory Healthcare.",
      "",
      "At Emory Healthcare we fuel your professional journey with better benefits, valuable resources, ongoing mentorship and leadership programs for all types of jobs, and a supportive environment that enables you to reach new heights in your career and be what you want to be.  We provide:",
      "",
      "",
      "",
      "7am-3:30pm/Full Time/ 40 Hours",
      "Supporting a diverse, equitable and inclusive culture.  Emory Healthcare (EHC) is dedicated to providing equal opportunities and access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression and/or veteran's status. EHC does not discriminate on the basis of any factor stated above or prohibited under applicable law. EHC respects, values, and celebrates the unique perspectives and backgrounds of all individuals. EHC aspires to create an environment of collaboration and true belonging for all our patients and team members.  Emory Healthcare (EHC) is committed to achieving a diverse workforce through equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training.",
      "",
      "ACCOMMODATIONS: EHC will provide reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request a reasonable accommodation, please contact the Office of Diversity, Equity, and Inclusion.”",
      "",
      "PHYSICAL REQUIREMENTS: (Medium-Heavy) 36-75 lbs., 0-33% of the work day (occasionally); 20-35 lbs., 34-66% of the workday; (frequently); 10-20 lbs., 67-100% of the workday (constantly); Lifting 75 lbs. max; Carrying of objects up to 35 lbs.; Occasional to frequent standing & walking; Occasional sitting; Close eye work (computers, typing, reading, writing); Physical demands may vary depending on assigned work area and work tasks.",
      "",
      "ENVIRONMENTAL FACTORS: Factors affecting environment conditions may vary depending on the assigned work area and tasks. Environmental exposures include, but are not limited to: Blood-borne pathogen exposure; Bio-hazardous waste Chemicals/gases/fumes/vapors; Communicable diseases; Electrical shock; Floor Surfaces; Hot/Cold Temperatures; Indoor/Outdoor conditions; Latex; Lighting; Patient care/handling injuries; Radiation; Shift work; Travel may be required; Use of personal protective equipment, including respirators; environmental conditions may vary depending on assigned work area and work tasks.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "d26a9bc3-1f54-49b4-b709-2c16ea912303"
  },
  {
    "jobTitle": "Patient Account Rep II",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133098/patient-account-rep-ii/job?in_iframe=1",
    "Description": [
      "Be inspired.  Be rewarded. Belong. At Emory Healthcare.",
      "At Emory Healthcare we fuel your professional journey with better benefits, valuable resources, ongoing mentorship and leadership programs for all types of jobs, and a supportive environment that enables you to reach new heights in your career and be what you want to be.  We provide:",
      "MINIMUM QUALIFICATIONS:",
      "JOIN OUR TEAM TODAY! Emory Healthcare (EHC), part of Emory University (EUV), is the most comprehensive academic health system in Georgia and the first and only in Georgia with a Magnet® designated ambulatory practice. We are made up of 11 hospitals-4 Magnet® designated, the Emory Clinic, and more than 425 provider locations. The Emory Healthcare Network, established in 2011, is the largest clinically integrated network in Georgia, with more than 3,450 physicians concentrating in 70 different subspecialties.",
      "",
      "Supporting a diverse, equitable and inclusive culture.  Emory Healthcare (EHC) is dedicated to providing equal opportunities and access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression and/or veteran's status. EHC does not discriminate on the basis of any factor stated above or prohibited under applicable law. EHC respects, values, and celebrates the unique perspectives and backgrounds of all individuals. EHC aspires to create an environment of collaboration and true belonging for all our patients and team members.  Emory Healthcare (EHC) is committed to achieving a diverse workforce through equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training.",
      "",
      "ACCOMODATIONS: EHC will provide reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request a reasonable accommodation, please contact the Office of Diversity, Equity, and Inclusion.”",
      "",
      "PHYSICAL REQUIREMENTS (MediumMax 25lbs):",
      "up to 25 lbs, 0-33% of the work day (occasionally); 11-25 lbs, 34-66% of the workday (frequently); 01-10 lbs, 67-100% of the workday (constantly); Lifting 25 lbs max; Carrying of objects up to 25 lbs; Occasional to frequent standing & walking, Occasional sitting, Close eye work (computers, typing, reading, writing), Physical demands may vary depending on assigned work area and work tasks. ENVIRONMENTAL FACTORS:",
      "Factors affecting environment conditions may vary depending on the assigned work area and tasks. Environmental exposures include, but are not limited to: Blood-borne pathogen exposure Bio-hazardous waste Chemicals/gases/fumes/vapors Communicable diseases Electrical shock , Floor Surfaces, Hot/Cold Temperatures, Indoor/Outdoor conditions, Latex, Lighting, Patient care/handling injuries, Radiation , Shift work, Travel may be required. Use of personal protective equipment, including respirators, environmental conditions may vary depending on assigned work area and work tasks.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "c90f900e-a3f7-4509-b996-5af4425174d0"
  },
  {
    "jobTitle": "Project Manager, Emory Health Network Expansion",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133081/project-manager%2c-emory-health-network-expansion/job?in_iframe=1",
    "Description": "NA",
    "jobID": "4eac3e9d-e355-4b9b-a872-bbabe8ab4e8a"
  },
  {
    "jobTitle": "Director, Interpreter & Translation Services",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133080/director%2c-interpreter-%26-translation-services/job?in_iframe=1",
    "Description": [
      "Hospital Director of Interpreter and Translation Services",
      "",
      "Oversees language access programs to ensure effective communication with patients who have limited English proficiency (LEP) or are deaf or hard of hearing. This role involves managing a team of interpreters and translators, coordinating language services, and ensuring compliance with regulatory standards.",
      "",
      "Responsibilities:",
      "Language Access Plan Management:",
      "Develop, implement, and maintain a comprehensive language access strategic plan.Ensure compliance with The Joint Commission, CMS, and requirements for other accrediting bodies related to interpreter and translations services.Maintain a database of qualified interpreters and translators.Coordinate and manage requests for interpretation and translation services.Allocate budget resources for language assistance services.",
      "",
      "Staff Training and Education:",
      "Train hospital staff on how to utilize language assistance services when serving patients.Provide ongoing education to staff regarding cultural competence and effective communication with LEP patients.Collaborate with clinical departments to integrate language services into patient care workflows.",
      "",
      "Quality Assurance and Monitoring:",
      "Monitor interpreter and translator performance.Evaluate the effectiveness of language services.Address any issues related to communication barriers promptly.",
      "",
      "Collaboration:",
      "Work closely with clinical teams, patient advocates, and administrative staff.Collaborate with community organizations to enhance language access services.",
      "",
      "Policy Development:",
      "Develop and update policies and procedures related to interpreter and translation services.Ensure alignment with regulatory standards and best practices.",
      "",
      "Financial Management, Reporting, and Documentation:",
      "Maintain accurate records of language services provided.Prepare reports for hospital leadership and regulatory agencies.Develop and oversee department budget, vendor contracts, and financial performance/billing services.",
      "",
      "Health Literacy:",
      "Translate documents, videos, media, etc., for departments and/or outsource to vendors as needed.",
      "",
      "Mininum Qualifications (Must have):",
      "Bachelor’s degree in a relevant field (e.g., linguistics, healthcare administration), master’s preferred.7-10 years of program management experience.Certification as a medical interpreter (e.g., CMI, CHI) preferred.Fluency in English and at least one other relevant language.Excellent interpersonal skills.Experience with translation.Good knowledge of medical terminology.Excellent verbal communication skills.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "74376a00-7539-4a03-8ce0-afad556ea04a"
  },
  {
    "jobTitle": "Maintenance Mechanic Specialist  II",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133079/maintenance-mechanic-specialist%c2%a0-ii/job?in_iframe=1",
    "Description": "NA",
    "jobID": "b6f80c38-54f9-4c24-9cda-04ab5b6e2f2e"
  },
  {
    "jobTitle": "Painter",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133078/painter/job?in_iframe=1",
    "Description": [
      "Be inspired.  Be rewarded. Belong. At Emory Healthcare.",
      "",
      "At Emory Healthcare we fuel your professional journey with better benefits, valuable resources, ongoing mentorship and leadership programs for all types of jobs, and a supportive environment that enables you to reach new heights in your career and be what you want to be.  We provide:",
      "",
      "Supporting a diverse, equitable and inclusive culture.  Emory Healthcare (EHC) is dedicated to providing equal opportunities and access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression and/or veteran's status. EHC does not discriminate on the basis of any factor stated above or prohibited under applicable law. EHC respects, values, and celebrates the unique perspectives and backgrounds of all individuals. EHC aspires to create an environment of collaboration and true belonging for all our patients and team members.  Emory Healthcare (EHC) is committed to achieving a diverse workforce through equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training.",
      "",
      "ACCOMMODATIONS: EHC will provide reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request a reasonable accommodation, please contact the Office of Diversity, Equity, and Inclusion.”",
      "",
      "PHYSICAL REQUIREMENTS: (Medium-Heavy) 36-75 lbs., 0-33% of the work day (occasionally); 20-35 lbs., 34-66% of the workday; (frequently); 10-20 lbs., 67-100% of the workday (constantly); Lifting 75 lbs. max; Carrying of objects up to 35 lbs.; Occasional to frequent standing & walking; Occasional sitting; Close eye work (computers, typing, reading, writing); Physical demands may vary depending on assigned work area and work tasks.",
      "",
      "ENVIRONMENTAL FACTORS: Factors affecting environment conditions may vary depending on the assigned work area and tasks. Environmental exposures include, but are not limited to: Blood-borne pathogen exposure; Bio-hazardous waste Chemicals/gases/fumes/vapors; Communicable diseases; Electrical shock; Floor Surfaces; Hot/Cold Temperatures; Indoor/Outdoor conditions; Latex; Lighting; Patient care/handling injuries; Radiation; Shift work; Travel may be required; Use of personal protective equipment, including respirators; environmental conditions may vary depending on assigned work area and work tasks.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "9b7afb71-0a83-4d31-9f15-8e47cc9ba78b"
  },
  {
    "jobTitle": "Cook",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133057/cook/job?in_iframe=1",
    "Description": [
      "Be inspired. Be valued. Belong.",
      "",
      "At Emory Healthcare we fuel your professional journey with better benefits, valuable resources, ongoing mentorship and leadership programs for all types of jobs, and a supportive environment that enables you to reach new heights in your career and be what you want to be.  We provide:",
      "Ongoing mentorship, development, leadership programs...and more!",
      "Supporting a diverse, equitable and inclusive culture.  Emory Healthcare (EHC) is dedicated to providing equal opportunities and access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression and/or veteran's status. EHC does not discriminate on the basis of any factor stated above or prohibited under applicable law. EHC respects, values, and celebrates the unique perspectives and backgrounds of all individuals. EHC aspires to create an environment of collaboration and true belonging for all our patients and team members.  Emory Healthcare (EHC) is committed to achieving a diverse workforce through equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training.",
      "",
      "ACCOMODATIONS: EHC will provide reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request a reasonable accommodation, please contact the Office of Diversity, Equity, and Inclusion.”",
      "",
      "PHYSICAL REQUIREMENTS: (Medium-Heavy) 36-75 lbs., 0-33% of the work day (occasionally); 20-35 lbs., 34-66% of the workday; (frequently); 10-20 lbs., 67-100% of the workday (constantly); Lifting 75 lbs. max; Carrying of objects up to 35 lbs.; Occasional to frequent standing & walking; Occasional sitting; Close eye work (computers, typing, reading, writing); Physical demands may vary depending on assigned work area and work tasks.ENVIRONMENTAL FACTORS: Factors affecting environment conditions may vary depending on the assigned work area and tasks. Environmental exposures include, but are not limited to: Blood-borne pathogen exposure; Bio-hazardous waste Chemicals/gases/fumes/vapors; Communicable diseases; Electrical shock; Floor Surfaces; Hot/Cold Temperatures; Indoor/Outdoor conditions; Latex; Lighting; Patient care/handling injuries; Radiation; Shift work; Travel may be required; Use of personal protective equipment, including respirators; environmental conditions may vary depending on assigned work area and work tasks.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "41334f48-2dd5-4bc2-b418-f632e3ff5b98"
  },
  {
    "jobTitle": "Research Assistant (ETS) | Temporary",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133027/research-assistant-%28ets%29-%7c-temporary/job?in_iframe=1",
    "Description": [
      "Emory University is a leading research university that fosters excellence and attracts world-class talent to innovate today and prepare leaders for the future. We welcome candidates who can contribute to the diversity and excellence of our academic community.",
      "About the hiring team –  we are an interdisciplinary team of biomedical engineers, computer scientists, software engineers, nursing researchers from the Center for Data Science at the Nell Hodgson Woodruff School of Nursing Emory and clinician scientists from the pediatric intensive care program at CHOA. Our team has diverse technical expertise in machine learning, deep learning, signal processing, software development, as well as clinical knowledge in pediatric critical care, neurology, nursing, cardiology, and clinical medicine in general.  About the project – Rich information exists in electronic health records (EHR) and high-resolution data from bedside patient monitoring and therapeutic devices, but advance AI/ML approaches are needed to integrate and make sense of these heterogenous data. This project will leverage one of its kind large multimodality pediatric critical care dataset to develop advance AI solutions to address various unmet needs in critical care of pediatric patients including prediction of in-hospital cardiac arrest, prediction of subacute critical illnesses, optimization of the utilization of life-supporting interventions etc.",
      "",
      "KEY RESPONSIBILITIES:",
      "JOB QUALIFICATIONS:",
      "JOB BENEFITS:",
      "",
      "NOTE: Position tasks are generally required to be performed in-person at an Emory University location.  Remote work from home day options may be granted at department discretion. Emory reserves the right to change remote work status with notice to employee.",
      "Emory University is dedicated to providing equal opportunities and equal access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression, and veteran's status. Emory University does not discriminate in admissions, educational programs, or employment on the basis of any factor stated above or prohibited under applicable law. Students, faculty, and staff are assured of participation in University programs and in the use of facilities without such discrimination. Emory University complies with Executive Order 11246, as amended, Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veteran's Readjustment Assistance Act, and applicable executive orders, federal and state regulations regarding nondiscrimination, equal opportunity and affirmative action. Emory University is committed to achieving a diverse workforce through application of its affirmative action, equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training. Inquiries regarding this policy should be directed to the Emory University Department of Equity and Inclusion, 201 Dowman Drive, Administration Building, Atlanta, GA 30322.Emory University is committed to providing reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request a reasonable accommodation, please contact the Department of Accessibility Services at 404-727-9877 (V) | 404-712-2049 (TDD). Please note that one week advance notice is preferred.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "e99a04dd-949c-466d-8763-1eedef4f8b1e"
  },
  {
    "jobTitle": "Patient Services Coordinator II FD (ETS) | Temporary",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133016/patient-services-coordinator-ii-fd-%28ets%29-%7c-temporary/job?in_iframe=1",
    "Description": [
      "This position serves as a key role in the patient's experience, serving as their first point of contact upon arrival to Emory facilities for clinical appointments. This position will work regularly with patients, families, providers, clinical and non-clinical staff, and is a critical component to ensuring patients have a smooth and positive experience with Emory. This position is ideal for a candidate who demonstrates compassion, a commitment to excellent customer service, critical thinking and problem solving skills, strong interpersonal and communication skills, and able to work in a high paced team environment. This role requires computer skills and comfort with navigating multiple applications simultaneously.",
      "",
      "KEY RESONSIBILITIES:",
      "MINIMUM QUALIFICATIONS:",
      "",
      "PREFERRED QUALIFICATIONS:",
      "",
      "ENVIRONMENTAL FACTORS:",
      "",
      "NOTE: Position tasks are required to be performed in-person at an Emory University location; working remote is not an option. Emory reserves the right to change this status with notice to employee.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "5bef6e00-d183-4117-a487-3551329b1d80"
  },
  {
    "jobTitle": "Administrative Assistant (ETS) | Temporary",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/133005/administrative-assistant-%28ets%29-%7c-temporary/job?in_iframe=1",
    "Description": [
      "Emory University is a leading research university that fosters excellence and attracts world-class talent to innovate today and prepare leaders for the future. We welcome candidates who can contribute to the diversity and excellence of our academic community.",
      "Administrative Assistant will work with Emory's Candler School of Theology and will provide administrative support for one or more of the following: general management, a research environment or a specific program.",
      "",
      "KEY RESPONSIBILITIES:",
      "MINIMUM QUALIFICATIONS:",
      "PREFERRED QUALIFICATIONS:",
      "NOTE: Position tasks are required to be performed in-person at an Emory University location; working remote is not an option. Emory reserves the right to change this status with notice to employee.",
      "Emory University is dedicated to providing equal opportunities and equal access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression, and veteran's status. Emory University does not discriminate in admissions, educational programs, or employment on the basis of any factor stated above or prohibited under applicable law. Students, faculty, and staff are assured of participation in University programs and in the use of facilities without such discrimination. Emory University complies with Executive Order 11246, as amended, Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veteran's Readjustment Assistance Act, and applicable executive orders, federal and state regulations regarding nondiscrimination, equal opportunity and affirmative action. Emory University is committed to achieving a diverse workforce through application of its affirmative action, equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training. Inquiries regarding this policy should be directed to the Emory University Department of Equity and Inclusion, 201 Dowman Drive, Administration Building, Atlanta, GA 30322.",
      "Emory University is committed to providing reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request a reasonable accommodation, please contact the Department of Accessibility Services at 404-727-9877 (V) | 404-712-2049 (TDD). Please note that one week advance notice is preferred.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "88082468-a548-4448-a15c-803f5987f2a1"
  },
  {
    "jobTitle": "Advance Practice Provider Talent Acquisition Manager",
    "jobDescriptionUrl": "https://non-clinical-emory.icims.com/jobs/132996/advance-practice-provider-talent-acquisition-manager/job?in_iframe=1",
    "Description": [
      "Where you matter as much as the work you do",
      "Join Emory Healthcare (EHC) if you’re looking for an opportunity with one of the nation's leading Atlanta hospitals in cardiology and heart surgery, cancer, neurology, and more! EHC is where those around you are dedicated to the power of teamwork, fostering an environment where you can learn, grow, and innovate with similarly passionate professionals.  Work with us to improve the quality of life throughout Georgia through partnerships with the U.S. Centers for Disease Control and Prevention, Georgia Institute of Technology, and other organizations and make a bigger, greater impact than you ever thought possible.",
      "Directly supervises non-exempt and exempt staff; provides leadership for department and system, including staff not under direct reporting.",
      "Responsibilities",
      "Job Requirements/Skills",
      "",
      "JOIN OUR TEAM TODAY! Emory Healthcare (EHC), part of Emory University (EUV), is the most comprehensive academic health system in Georgia and the first and only in Georgia with a Magnet® designated ambulatory practice. We are made up of 11 hospitals-4 Magnet® designated, the Emory Clinic, and more than 425 provider locations. The Emory Healthcare Network, established in 2011, is the largest clinically integrated network in Georgia, with more than 3,450 physicians concentrating in 70 different subspecialties.",
      "Supporting a diverse, equitable and inclusive culture.  Emory Healthcare (EHC) is dedicated to providing equal opportunities and access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression and/or veteran's status. EHC does not discriminate on the basis of any factor stated above or prohibited under applicable law. EHC respects, values, and celebrates the unique perspectives and backgrounds of all individuals. EHC aspires to create an environment of collaboration and true belonging for all our patients and team members.  Emory Healthcare (EHC) is committed to achieving a diverse workforce through equal opportunity and nondiscrimination policy in all aspects of employment including recruitment, hiring, promotions, transfers, discipline, terminations, wage and salary administration, benefits, and training.",
      "",
      "ACCOMODATIONS: EHC will provide reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request a reasonable accommodation, please contact the Office of Diversity, Equity, and Inclusion.",
      "",
      "PHYSICAL REQUIREMENTS (Medium): 20-50 lbs; 0-33% of the work day (occasionally); 11-25 lbs, 34-66% of the workday (frequently); 01-10 lbs, 67-100% of the workday (constantly); Lifting 50 lbs max; Carrying of objects up to 25 lbs; Occasional to frequent standing & walking, Occasional sitting, Close eye work (computers, typing, reading, writing), Physical demands may vary depending on assigned work area and work tasks. ENVIRONMENTAL FACTORS: Factors affecting environment conditions may vary depending on the assigned work area and tasks. Environmental exposures include, but are not limited to: Blood-borne pathogen exposure Bio-hazardous waste Chemicals/gases/fumes/vapors Communicable diseases Electrical shock, Floor Surfaces, Hot/Cold Temperatures, Indoor/Outdoor conditions, Latex, Lighting, Patient care/handling injuries, Radiation, Shift work, Travel may be required. Use of personal protective equipment, including respirators, environmental conditions may vary depending on assigned work area and work tasks.",
      "Software Powered by iCIMSwww.icims.com"
    ],
    "jobID": "c2306a3e-15b8-41b1-ad8c-93a5c7440c3f"
  }
]